Revit 2024 API
View.Print Method
Print this view with the default view template and using the print setting of the current active document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Print()
Visual Basic
Public Sub Print
Visual C++
public:
void Print()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException | Thrown when the view cannot be printed.
See Also
View Class
Print Overload
Autodesk.Revit.DB Namespace